In [1]:
!pip install sqlalchemy
!pip install pyhive
!pip install thrift
!pip install sasl
!pip install thrift-sasl 
!pip install psycopg2

import psycopg2
import sqlalchemy
import pandas as pd
from sqlalchemy.engine import create_engine

Requirement already satisfied: sqlalchemy in /opt/conda/lib/python3.10/site-packages (1.4.37)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: pyhive in /opt/conda/lib/python3.10/site-packages (0.6.5)
Requirement already satisfied: future in /opt/conda/lib/python3.10/site-packages (from pyhive) (0.18.2)
Requirement already satisfied: python-dateutil in /opt/conda/lib/python3.10/site-packages (from pyhive) (2.8.2)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil->pyhive) (1.16.0)
Requirement already satisfied: thrift in /opt/conda/lib/python3.10/site-packages (0.16.0)
Requirement already satisfied: six>=1.7.2 in /opt/conda/lib/python3.10/site-packages (from thrift) (1.16.0)
Requirement already satisfied: sasl in /opt/conda/lib/python3.10/site-packages (0.3.1)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from sasl) (1.16.0)
Requirement already satisfied: thrift-sasl in /opt/conda/lib/python3.10/site-packages (0.4.3)
Requirement already satisfied: thrift>=0.10.0 in /opt/conda/lib/python3.10/site-packages (from thrift-sasl) (0.16.0)
Requirement already satisfied: pure-sasl>=0.6.2 in /opt/conda/lib/python3.10/site-packages (from thrift-sasl) (0.6.2)
Requirement already satisfied: six>=1.13.0 in /opt/conda/lib/python3.10/site-packages (from thrift-sasl) (1.16.0)
Requirement already satisfied: psycopg2 in /opt/conda/lib/python3.10/site-packages (2.9.3)

In [2]:

engine = create_engine('hive://spark-thrift:10000/default')
pd.read_sql_query("create database if not exists sample",con=engine)
pd.read_sql_query("show databases",con=engine)

  namespace
0   default
1    sample

In [3]:
pd.read_sql_query("use sample", con=engine)
pd.read_sql_query("show tables", con=engine)

  database tableName  isTemporary
0   sample    aisles        False

In [4]:
pd.read_sql_query("select * from sample.aisles limit 10;", con=engine)

   aisle_id                       aisle
0       NaN                       aisle
1       1.0       prepared soups salads
2       2.0           specialty cheeses
3       3.0         energy granola bars
4       4.0               instant foods
5       5.0  marinades meat preparation
6       6.0                       other
7       7.0               packaged meat
8       8.0             bakery desserts
9       9.0                 pasta sauce

In [ ]:
pd.read_sql_query("show tables", con=engine)

In [10]:
pd.read_sql_query("drop table if exists sample.hudi_tbl", con=engine);

In [11]:
pd.read_sql_query("""
    create table sample.hudi_tbl (
      id int,
      name string,
      price double,
      ts bigint
    ) 
    using hudi
    tblproperties (
      type = 'cow',
      primaryKey = 'id',
      hoodie.datasource.hive_sync.mode = 'JDBC'
    )
""", con=engine)

Empty DataFrame
Columns: [Result]
Index: []

In [12]:
pd.read_sql_query("show tables", con=engine)

  database tableName  isTemporary
0   sample    aisles        False
1   sample  hudi_tbl        False

In [14]:
pd.read_sql_query("""

insert into sample.hudi_tbl 
values (2,'b',2.0, 1655951583.549022)

""", con=engine)

Empty DataFrame
Columns: [Result]
Index: []

In [15]:
pd.read_sql_query("""select * from sample.hudi_tbl""", con=engine)

,_hoodie_commit_time,_hoodie_commit_seqno,_hoodie_record_key,_hoodie_partition_path,_hoodie_file_name,id,name,price,ts
0,20220706175324404,20220706175324404_0_1,id:2,,24e7d133-7bc4-4181-9626-d74207e4289d-0_0-36-34...,2,b,2.0,1655951583

# using datetime module
import datetime;
  
# ct stores current time
ct = datetime.datetime.now()
print("current time:-", ct)
  
# ts store timestamp of current time
ts = ct.timestamp()
print("timestamp:-", ts)

## for pg hms testing ##


engine = create_engine('postgresql://hive:pssd@postgres-hms:5432/metastore')
pd.read_sql_query("""
SELECT datname FROM pg_database
WHERE datistemplate = false;
""",con=engine)

pd.read_sql_query("""
SELECT distinct table_catalog, table_schema, table_name
FROM information_schema.tables
where table_schema = 'public'
""",con=engine)

pd.read_sql_query("""
SELECT * from "TBLS"
""",con=engine)

In [ ]:
engine = create_engine('hive://spark-thrift:10000/default')
pd.read_sql_query("use sample", con=engine)
pd.read_sql_query("show tables", con=engine)

In [ ]:
pd.read_sql_query("drop table if exists sample.aisles", con=engine)
pd.read_sql_query("""
create external table sample.aisles (aisle_id integer, aisle varchar(100) ) 
ROW FORMAT DELIMITED 
FIELDS TERMINATED BY ','
STORED AS TEXTFILE 
LOCATION '/aisles' 
""", con=engine)

In [ ]:
pd.read_sql_query("select * from sample.aisles limit 100", con=engine)

In [ ]:
pd.read_sql_query("drop table if exists sample.tbl1", con=engine)

In [ ]:

pd.read_sql_query("""
    create external table if not exists sample.tbl1 (ckey int, cval varchar(64))
    ROW FORMAT DELIMITED 
    FIELDS TERMINATED BY ','
    STORED AS TEXTFILE 
    LOCATION 'hdfs://hadoop-service:9000/data/tbl1'
""", con=engine)

In [ ]:
pd.read_sql_query("select * from sample.tbl1 limit 100", con=engine)

In [ ]:
pd.read_sql_query("insert into sample.tbl1 values (1, 'a')", con=engine)